## Pandas
pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

You can use it to organise data into tables and do calculations on such tables, you will use the
pandas module. A module is a package of various pieces of code that can be used individually. The pandas module provides very
extensive and advanced data analysis capabilities to compliment Python. This course only scratches the surface of pandas.
I have to tell the computer that I’m going to use a module.

In [1]:
import pandas as pd

### Importance of Pandas

- Pandas provide essential data structures like series, dataframes, and panels which help in manipulating data sets and time series.

- It is free to use and an open source library, making it one of the most widely used data science libraries in the world.

- Pandas possess the power to perform various tasks. Whether it is computing tasks like finding the mean, median and mode of data, or a task of handling large CSV files and manipulating the contents according to our will, Pandas can do it all. In short, to master data science, you must be skillful in Pandas.

`From now on, we will be using real life data to learn and practice as we progress through the course. the file/data can be found in the folder that contains this notebook.`

`Data analysis often starts with a question or with some data.`

- What is the total, smallest, largest, and average number of deaths due to TB?
- What is the death rate (number of deaths divided by population) of each country?
- Which countries have the smallest and largest number of deaths?
- Which countries have the smallest and largest death rate?

**Loading the data**

Many applications can read files in Excel format, and pandas can too. Asking the
computer to read the data looks like this:

In [2]:
data = pd.read_excel('WHO POP TB some.xls')
data

                  Country  Population (1000s)  TB deaths
0                  Angola               21472       6900
1                  Brazil              200362       4400
2                   China             1393337      41000
3       Equatorial Guinea                 757         67
4           Guinea-Bissau                1704       1200
5                   India             1252140     240000
6              Mozambique               25834      18000
7                Portugal               10608        140
8      Russian Federation              142834      17000
9   Sao Tome and Principe                 193         18
10           South Africa               52776      25000
11            Timor-Leste                1133        990

The variable name data is not descriptive, but as there is only one dataset in our analysis,
there is no possible confusion with other data, and short names help to keep the lines of
code short.

The function read_excel() takes a file name as an argument and returns the table contained in the file. In pandas, tables are called dataframes . 

To load the data, I simply call the function and store the returned dataframe in a variable. A file name must be given as a string , a piece of text surrounded by quotes. 

The quote marks tell Python that this isn’t a variable, function or module name. Also, the quote marks state that this is a single name, even if it contains spaces, punctuation and other characters besides letters.

Misspelling the file name, or not having the file in the same folder as the notebook containing the code, results in a file not found error.

**Selecting a column**

Now you have the data, let the analysis begin!

Let’s tackle the first part of the first question: ‘What are the total, smallest, largest and
average number of deaths due to TB?’ Obtaining the total number will be done in two
steps: first select the column with the TB deaths, then sum the values in that column.
Selecting a single column of a dataframe is done with an expression in the format:

`dataFrame['column name']`

In [3]:
data['TB deaths']

0       6900
1       4400
2      41000
3         67
4       1200
5     240000
6      18000
7        140
8      17000
9         18
10     25000
11       990
Name: TB deaths, dtype: int64

**Task-1**

Select the population column and store it in a variable, so
that you can use it in later exercises.

In [4]:
# Write your code here
population = data["Population (1000s)"]

**Calculations on a column**

In [5]:
tbColumn = data['TB deaths']
tbColumn.sum()

354715

In [6]:
tbColumn.min()

18

In [7]:
tbColumn.max()

240000

Like sum() , the column methods min() and max() don’t need arguments, whereas the Python functions min() and max() did need them, because there was no context (column) providing the values.

The average number is computed as before, dividing the total by the number of countries.

In [8]:
tbColumn.sum() / 12

29559.583333333332

This kind of average is called the mean and there’s a method for that.

In [9]:
tbColumn.mean()

29559.583333333332

In [10]:
tbColumn.median()

5650.0

**Task-2**

Practise the use of column methods by applying them to the population column you
obtained in Task-1

In [11]:
#SUM

population.sum()

3103150

In [12]:
#MAXIMUM

population.max()

1393337

In [13]:
#MINIMUM

population.min()

193

In [14]:
#AVERAGE

population.mean()

258595.83333333334

In [16]:
#AVERAGE

population.sum() / len(population)

258595.83333333334

In [17]:
population.median()

23653.0

**Sorting on a column**

One of the research questions was: which countries have the smallest and largest number of deaths?

Being a small table, it is not too difficult to scan the TB deaths column and find those countries. However, such a process is prone to errors and impractical for large tables. It’s much better to sort the table by that column, and then look up the countries in the first and last rows.

As you’ve guessed by now, sorting a table is another single line of code.

In [18]:
data.sort_values('TB deaths')

                  Country  Population (1000s)  TB deaths
9   Sao Tome and Principe                 193         18
3       Equatorial Guinea                 757         67
7                Portugal               10608        140
11            Timor-Leste                1133        990
4           Guinea-Bissau                1704       1200
1                  Brazil              200362       4400
0                  Angola               21472       6900
8      Russian Federation              142834      17000
6              Mozambique               25834      18000
10           South Africa               52776      25000
2                   China             1393337      41000
5                   India             1252140     240000

The dataframe method sort_values() takes as argument a column name and returns a new dataframe where the rows are in ascending order of the values in that column. 

Note that sorting doesn’t modify the original dataframe.

In [19]:
data # rows still in original order

                  Country  Population (1000s)  TB deaths
0                  Angola               21472       6900
1                  Brazil              200362       4400
2                   China             1393337      41000
3       Equatorial Guinea                 757         67
4           Guinea-Bissau                1704       1200
5                   India             1252140     240000
6              Mozambique               25834      18000
7                Portugal               10608        140
8      Russian Federation              142834      17000
9   Sao Tome and Principe                 193         18
10           South Africa               52776      25000
11            Timor-Leste                1133        990

It’s also possible to sort on a column that has text instead of numbers; the rows will be
sorted in alphabetical order.

In [20]:
data.sort_values('Country')

                  Country  Population (1000s)  TB deaths
0                  Angola               21472       6900
1                  Brazil              200362       4400
2                   China             1393337      41000
3       Equatorial Guinea                 757         67
4           Guinea-Bissau                1704       1200
5                   India             1252140     240000
6              Mozambique               25834      18000
7                Portugal               10608        140
8      Russian Federation              142834      17000
9   Sao Tome and Principe                 193         18
10           South Africa               52776      25000
11            Timor-Leste                1133        990

**Task-3**

Sort the same table by population, to quickly see which are the least and the most populous countries.

In [21]:
# Write your code here
data.sort_values('Population (1000s)')

                  Country  Population (1000s)  TB deaths
9   Sao Tome and Principe                 193         18
3       Equatorial Guinea                 757         67
11            Timor-Leste                1133        990
4           Guinea-Bissau                1704       1200
7                Portugal               10608        140
0                  Angola               21472       6900
6              Mozambique               25834      18000
10           South Africa               52776      25000
8      Russian Federation              142834      17000
1                  Brazil              200362       4400
5                   India             1252140     240000
2                   China             1393337      41000

**Calculations over columns**

The last remaining task is to calculate the death rate of each country. You may recall that with the simple approach I’d have to write:

`rateAngola = deathsInAngola * 100 / populationOfAngola
rateBrazil = deathsInBrazil * 100 / populationOfBrazil`

and so on, and so on. If you’ve used spreadsheets, it’s the same process: create the formula for the first row and then copy it down for all the rows. This is laborious and errorprone, e.g. if rows are added later on. Given that data is organised by columns, wouldn’t it be nice to simply write the following?

`rateColumn = deathsColumn * 100 / populationColumn`

With pandas we can do this:

In [22]:
deathsColumn = data['TB deaths']
populationColumn = data['Population (1000s)']
rateColumn = deathsColumn * 100 / populationColumn
rateColumn

0     32.134873
1      2.196025
2      2.942576
3      8.850727
4     70.422535
5     19.167186
6     69.675621
7      1.319759
8     11.901928
9      9.326425
10    47.370017
11    87.378641
dtype: float64

With pandas, the arithmetic operators become much smarter. When adding, subtracting, multiplying or dividing columns, the computer understands that the operation is to be done row by row and creates a new column. All well and nice, but how to put that new column into the dataframe, in order to have everything in a single table? In an assignment `variable = expression` , if the variable hasn’t been mentioned before, the computer creates the variable and stores in it the expression’s value. Likewise, if I assign to a column that doesn’t exist in the dataframe, the computer will create it.

In [23]:
data['TB deaths (per 100,000)'] = rateColumn
data

,Country,Population (1000s),TB deaths,"TB deaths (per 100,000)"
0,Angola,21472,6900,32.134873
1,Brazil,200362,4400,2.196025
2,China,1393337,41000,2.942576
3,Equatorial Guinea,757,67,8.850727
4,Guinea-Bissau,1704,1200,70.422535
5,India,1252140,240000,19.167186
6,Mozambique,25834,18000,69.675621
7,Portugal,10608,140,1.319759
8,Russian Federation,142834,17000,11.901928
9,Sao Tome and Principe,193,18,9.326425
10,South Africa,52776,25000,47.370017
11,Timor-Leste,1133,990,87.378641